In [1]:
import pandas as pd

In [10]:
# creating the DataFrame

data = {
    "OrderID": [1001, 1002, 1003, 1004, 1005, 1006, 1007, 1008],
    "CustomerName": ["Alice", "Bob", "Charlie", "David", "Eva", "Frank", "Grace", "Henry"],
    "Product": ["iPhone 13", "T-shirt", "Laptop", "Shoes", "T-shirt", "Headphones", "Jacket", "Shoes"],
    "Category": ["Electronics", "Clothing", "Electronics", "Footwear", "Clothing", "Electronics", "Clothing", "Footwear"],
    "Quantity": [1, 2, 1, 1, 3, 2, 1, 2],
    "Price": [800, 20, 1200, 50, 20, 100, 80, 50],
    "OrderDate": ["2022-01-15", "2022-01-17", "2022-01-20", "2022-01-22", "2022-01-25", "2022-01-26", "2022-01-28", "2022-01-30"],
    "Country": ["USA", "UK", "Canada", "USA", "UK", "USA", "Germany", "USA"]
}

df = pd.DataFrame(data)
df["OrderDate"] = pd.to_datetime(df["OrderDate"])
df.head()

,OrderID,CustomerName,Product,Category,Quantity,Price,OrderDate,Country
0,1001,Alice,iPhone 13,Electronics,1,800,2022-01-15,USA
1,1002,Bob,T-shirt,Clothing,2,20,2022-01-17,UK
2,1003,Charlie,Laptop,Electronics,1,1200,2022-01-20,Canada
3,1004,David,Shoes,Footwear,1,50,2022-01-22,USA
4,1005,Eva,T-shirt,Clothing,3,20,2022-01-25,UK

In [12]:
df["TotalSale"] = df["Quantity"] * df["Price"]
df.head()

,OrderID,CustomerName,Product,Category,Quantity,Price,OrderDate,Country,TotalSale
0,1001,Alice,iPhone 13,Electronics,1,800,2022-01-15,USA,800
1,1002,Bob,T-shirt,Clothing,2,20,2022-01-17,UK,40
2,1003,Charlie,Laptop,Electronics,1,1200,2022-01-20,Canada,1200
3,1004,David,Shoes,Footwear,1,50,2022-01-22,USA,50
4,1005,Eva,T-shirt,Clothing,3,20,2022-01-25,UK,60

In [13]:
# total revenue
print("Total Revenue: $", df["TotalSale"].sum())

Total Revenue: $ 2530

In [15]:
# sorting data by country
df.groupby("Country")["TotalSale"].sum()

Country
Canada     1200
Germany      80
UK          100
USA        1150
Name: TotalSale, dtype: int64

In [17]:
# most sold products
df.groupby("Product")["Quantity"].sum().sort_values(ascending=False)

Product
T-shirt       5
Shoes         3
Headphones    2
Jacket        1
Laptop        1
iPhone 13     1
Name: Quantity, dtype: int64

In [18]:
# sorting the data by which has order>1
df[df["Quantity"] > 1]

,OrderID,CustomerName,Product,Category,Quantity,Price,OrderDate,Country,TotalSale
1,1002,Bob,T-shirt,Clothing,2,20,2022-01-17,UK,40
4,1005,Eva,T-shirt,Clothing,3,20,2022-01-25,UK,60
5,1006,Frank,Headphones,Electronics,2,100,2022-01-26,USA,200
7,1008,Henry,Shoes,Footwear,2,50,2022-01-30,USA,100

In [19]:
# sales by category
df.groupby("Category")["TotalSale"].sum()

Category
Clothing        180
Electronics    2200
Footwear        150
Name: TotalSale, dtype: int64